BackEnd-Rails/app/models/book.rb

  def self.update_estados
    all.each do |book|
---
SELECT "books".* FROM "books"