BackEnd-Rails/app/controllers/books_controller.rb

  def by_user
    @books = Book.where(Student_id: params[:student_id])
---
SELECT "books".* FROM "books" WHERE "books"."Student_id" = ?  [["Student_id", 1]]

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("Student_id", "Tecnico_id", "Room_id", "RAZ_RES", "HOR_INI_RES", "HOR_FIN_RES", "EST_RES", "created_at", "updated_at", "EST_TIM_RES") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "EST_RES" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["EST_RES", 1], ["updated_at", "2024-01-02 08:36:32.748165"], ["id", 1]]