BackEnd-Rails/app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."Tecnico_id" = ? AND "books"."EST_RES" = ?  [["Tecnico_id", 1], ["EST_RES", 0]]
---
  def by_technician
    @books = Book.where(Tecnico_id: params[:tecnico_id], EST_RES: false)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "EST_RES" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["EST_RES", 1], ["updated_at", "2024-01-02 08:36:32.748165"], ["id", 1]]
---
  def update_est_res_to_true
    @book = Book.find(params[:id])  # Encuentra el libro por su ID
    if @book.update(EST_RES: true)  # Intenta actualizar el atributo EST_RES a true

INSERT INTO "books" ("Student_id", "Tecnico_id", "Room_id", "RAZ_RES", "HOR_INI_RES", "HOR_FIN_RES", "EST_RES", "created_at", "updated_at", "EST_TIM_RES") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    if @book.save