BackEnd-Rails/app/controllers/edificios_controller.rb

SELECT "edificios".* FROM "edificios"
---
  def index
    @edificios = Edificio.all