BackEnd-Rails/app/controllers/floors_controller.rb

SELECT "floors".* FROM "floors"
---
  def index
    @floors = Floor.all

INSERT INTO "floors" ("NOM_PIS", "DES_PIS", "IMG_PIS", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @floor = Floor.new(floor_params)

    if @floor.save

SELECT "floors".* FROM "floors" WHERE "floors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_floor
      @floor = Floor.find(params[:id])