BackEnd-Rails/app/controllers/horarios_controller.rb

  def index
    @horarios = Horario.all
---
SELECT "horarios".* FROM "horarios"