BackEnd-Rails/app/controllers/horas_controller.rb

SELECT "horas".* FROM "horas"
---
  def index
    @horas = Hora.all