BackEnd-Rails/app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."Floor_id" = ?  [["Floor_id", 1]]
---
  def by_floor
    @rooms = Room.where(Floor_id: params[:floor_id])

INSERT INTO "rooms" ("Floor_id", "NOM_HAB", "TIP_HAB", "CAP_HAB", "DIS_HAB", "created_at", "updated_at", "Edificio_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save

UPDATE "rooms" SET "Floor_id" = ?, "NOM_HAB" = ?, "TIP_HAB" = ?, "CAP_HAB" = ?, "DIS_HAB" = ?, "updated_at" = ?, "Edificio_id" = ? WHERE "rooms"."id" = ?  [["Floor_id", 2], ["NOM_HAB", "Laboratorio 3"], ["TIP_HAB", "Laboratorio"], ["CAP_HAB", 48], ["DIS_HAB", 1], ["updated_at", "2024-01-10 03:15:26.450388"], ["Edificio_id", 1], ["id", 2]]
---
  def update
    respond_to do |format|
      if @room.update(room_params)

DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 21]]
---
  def destroy
    @room.destroy!

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def set_room
      @room = Room.find(params[:id])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."DIS_HAB" = ?  [["DIS_HAB", 1]]
---
  def by_disponible
    @rooms = Room.where(DIS_HAB: true)