BackEnd-Rails/app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."DIS_HAB" = ?  [["DIS_HAB", 1]]
---
  def by_disponible
    @rooms = Room.where(DIS_HAB: true)