BackEnd-Rails/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    if @student.save
---
INSERT INTO "students" ("NOM_USE", "APE_USE", "COR_USE", "SEC_USE_digest", "CAR_USE", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @student.update(student_params)
---
UPDATE "students" SET "NOM_USE" = ?, "COR_USE" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["NOM_USE", "Juan"], ["COR_USE", "jsanchez@gmail.com"], ["updated_at", "2024-01-10 03:11:46.125996"], ["id", 2]]

  def destroy
    @student.destroy!
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 10]]