BackEnd-Rails/app/controllers/tecnicos_controller.rb

  def index
    @tecnicos = Tecnico.all
---
SELECT "tecnicos".* FROM "tecnicos"

  def create
    @tecnico = Tecnico.new(tecnico_params)

    if @tecnico.save
---
INSERT INTO "tecnicos" ("NOM_TEC", "APE_TEC", "FEC_NAC_TEC", "FEC_ING_TEC", "created_at", "updated_at", "NOM_USER_TEC", "CON_TEC") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"